OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1615.h
extern __at(0x0812) __sfr AT1PHSL;

typedef union
  {
  struct
    {
    unsigned AT1PHS0            : 1;
    unsigned AT1PHS1            : 1;
    unsigned AT1PHS2            : 1;
    unsigned AT1PHS3            : 1;
    unsigned AT1PHS4            : 1;
    unsigned AT1PHS5            : 1;
    unsigned AT1PHS6            : 1;
    unsigned AT1PHS7            : 1;
    };

  struct
    {
    unsigned PHS0               : 1;
    unsigned PHS1               : 1;
    unsigned PHS2               : 1;
    unsigned PHS3               : 1;
    unsigned PHS4               : 1;
    unsigned PHS5               : 1;
    unsigned PHS6               : 1;
    unsigned PHS7               : 1;
    };
  } __AT1PHSLbits_t;

extern __at(0x0812) volatile __AT1PHSLbits_t AT1PHSLbits;

#define _AT1PHS0                0x01
#define _PHS0                   0x01
#define _AT1PHS1                0x02
#define _PHS1                   0x02
#define _AT1PHS2                0x04
#define _PHS2                   0x04
#define _AT1PHS3                0x08
#define _PHS3                   0x08
#define _AT1PHS4                0x10
#define _PHS4                   0x10
#define _AT1PHS5                0x20
#define _PHS5                   0x20
#define _AT1PHS6                0x40
#define _PHS6                   0x40
#define _AT1PHS7                0x80
#define _PHS7                   0x80

//==============================================================================


//==============================================================================
//        AT1PHSH Bits

extern __at(0x0813) __sfr AT1PHSH;

typedef union
  {
  struct
    {
    unsigned AT1PHS8            : 1;
    unsigned AT1PHS9            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PHS8               : 1;
    unsigned PHS9               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PHSL8              : 1;
    unsigned PHSL9              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __AT1PHSHbits_t;

extern __at(0x0813) volatile __AT1PHSHbits_t AT1PHSHbits;

#define _AT1PHS8                0x01
#define _PHS8                   0x01
#define _PHSL8                  0x01
#define _AT1PHS9                0x02
#define _PHS9                   0x02
#define _PHSL9                  0x02

//==============================================================================


//==============================================================================
//        AT1CON0 Bits

extern __at(0x0814) __sfr AT1CON0;

typedef union
  {
  struct
    {
    unsigned MODE               : 1;
    unsigned APMOD              : 1;
    unsigned                    : 1;
    unsigned POL                : 1;
    unsigned PS0                : 1;
    unsigned PS1                : 1;
    unsigned PREC               : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned AT1MODE            : 1;
    unsigned AT1APMOD           : 1;
    unsigned                    : 1;
    unsigned AT1POL             : 1;
    unsigned AT1PS0             : 1;
    unsigned AT1PS1             : 1;
    unsigned AT1PREC            : 1;
    unsigned AT1EN              : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned AT1PS              : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 4;
    unsigned PS                 : 2;
    unsigned                    : 2;
    };
  } __AT1CON0bits_t;

extern __at(0x0814) volatile __AT1CON0bits_t AT1CON0bits;

#define _MODE                   0x01
#define _AT1MODE                0x01
#define _APMOD                  0x02
#define _AT1APMOD               0x02
#define _POL                    0x08
#define _AT1POL                 0x08
#define _PS0                    0x10
#define _AT1PS0                 0x10
#define _PS1                    0x20
#define _AT1PS1                 0x20
#define _PREC                   0x40
#define _AT1PREC                0x40
#define _EN                     0x80
#define _AT1EN                  0x80

//==============================================================================


//==============================================================================
//        AT1CON1 Bits

extern __at(0x0815) __sfr AT1CON1;

typedef union
  {
  struct
    {
    unsigned VALID              : 1;
    unsigned ACCS               : 1;
    unsigned MPP                : 1;
    unsigned                    : 1;
    unsigned PRP                : 1;
    unsigned                    : 1;
    unsigned PHP                : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned AT1VALID           : 1;
    unsigned AT1ACCS            : 1;
    unsigned AT1MPP             : 1;
    unsigned                    : 1;
    unsigned AT1PRP             : 1;
    unsigned                    : 1;
    unsigned AT1PHP             : 1;
    unsigned                    : 1;
    };
  } __AT1CON1bits_t;

extern __at(0x0815) volatile __AT1CON1bits_t AT1CON1bits;

#define _VALID                  0x01
#define _AT1VALID               0x01
#define _ACCS                   0x02
#define _AT1ACCS                0x02
#define _MPP                    0x04
#define _AT1MPP                 0x04
#define _PRP                    0x10
#define _AT1PRP                 0x10
#define _PHP                    0x40
#define _AT1PHP                 0x40

//==============================================================================


//==============================================================================
//        AT1IR0 Bits

extern __at(0x0816) __sfr AT1IR0;

typedef struct
  {
  unsigned AT1PERIF             : 1;
  unsigned AT1MISSIF            : 1;
  unsigned AT1PHSIF             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __AT1IR0bits_t;

extern __at(0x0816) volatile __AT1IR0bits_t AT1IR0bits;

