OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1615.h
#define _AT1PERIF               0x01
#define _AT1MISSIF              0x02
#define _AT1PHSIF               0x04

//==============================================================================


//==============================================================================
//        AT1IE0 Bits

extern __at(0x0817) __sfr AT1IE0;

typedef struct
  {
  unsigned AT1PERIE             : 1;
  unsigned AT1MISSIE            : 1;
  unsigned AT1PHSIE             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __AT1IE0bits_t;

extern __at(0x0817) volatile __AT1IE0bits_t AT1IE0bits;

#define _AT1PERIE               0x01
#define _AT1MISSIE              0x02
#define _AT1PHSIE               0x04

//==============================================================================


//==============================================================================
//        AT1IR1 Bits

extern __at(0x0818) __sfr AT1IR1;

typedef struct
  {
  unsigned AT1CC1IF             : 1;
  unsigned AT1CC2IF             : 1;
  unsigned AT1CC3IF             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __AT1IR1bits_t;

extern __at(0x0818) volatile __AT1IR1bits_t AT1IR1bits;

#define _AT1CC1IF               0x01
#define _AT1CC2IF               0x02
#define _AT1CC3IF               0x04

//==============================================================================


//==============================================================================
//        AT1IE1 Bits

extern __at(0x0819) __sfr AT1IE1;

typedef struct
  {
  unsigned AT1CC1IE             : 1;
  unsigned AT1CC2IE             : 1;
  unsigned AT1CC3IE             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __AT1IE1bits_t;

extern __at(0x0819) volatile __AT1IE1bits_t AT1IE1bits;

#define _AT1CC1IE               0x01
#define _AT1CC2IE               0x02
#define _AT1CC3IE               0x04

//==============================================================================

extern __at(0x081A) __sfr AT1STPT;

//==============================================================================
//        AT1STPTL Bits

extern __at(0x081A) __sfr AT1STPTL;

typedef union
  {
  struct
    {
    unsigned AT1STPT0           : 1;
    unsigned AT1STPT1           : 1;
    unsigned AT1STPT2           : 1;
    unsigned AT1STPT3           : 1;
    unsigned AT1STPT4           : 1;
    unsigned AT1STPT5           : 1;
    unsigned AT1STPT6           : 1;
    unsigned AT1STPT7           : 1;
    };

  struct
    {
    unsigned STPT0              : 1;
    unsigned STPT1              : 1;
    unsigned STPT2              : 1;
    unsigned STPT3              : 1;
    unsigned STPT4              : 1;
    unsigned STPT5              : 1;
    unsigned STPT6              : 1;
    unsigned STPT7              : 1;
    };
  } __AT1STPTLbits_t;

extern __at(0x081A) volatile __AT1STPTLbits_t AT1STPTLbits;

#define _AT1STPT0               0x01
#define _STPT0                  0x01
#define _AT1STPT1               0x02
#define _STPT1                  0x02
#define _AT1STPT2               0x04
#define _STPT2                  0x04
#define _AT1STPT3               0x08
#define _STPT3                  0x08
#define _AT1STPT4               0x10
#define _STPT4                  0x10
#define _AT1STPT5               0x20
#define _STPT5                  0x20
#define _AT1STPT6               0x40
#define _STPT6                  0x40
#define _AT1STPT7               0x80
#define _STPT7                  0x80

//==============================================================================


//==============================================================================
//        AT1STPTH Bits

extern __at(0x081B) __sfr AT1STPTH;

typedef union
  {
  struct
    {
    unsigned AT1STPT8           : 1;
    unsigned AT1STPT9           : 1;
    unsigned AT1STPT10          : 1;
    unsigned AT1STPT11          : 1;
    unsigned AT1STPT12          : 1;
    unsigned AT1STPT13          : 1;
    unsigned AT1STPT14          : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned STPT8              : 1;
    unsigned STPT9              : 1;
    unsigned STPT10             : 1;
    unsigned STPT11             : 1;
    unsigned STPT12             : 1;
    unsigned STPT13             : 1;
    unsigned STPT14             : 1;
    unsigned                    : 1;
    };
  } __AT1STPTHbits_t;

extern __at(0x081B) volatile __AT1STPTHbits_t AT1STPTHbits;

#define _AT1STPT8               0x01
#define _STPT8                  0x01
#define _AT1STPT9               0x02
#define _STPT9                  0x02
#define _AT1STPT10              0x04
#define _STPT10                 0x04
#define _AT1STPT11              0x08
#define _STPT11                 0x08
#define _AT1STPT12              0x10
#define _STPT12                 0x10
#define _AT1STPT13              0x20
#define _STPT13                 0x20
#define _AT1STPT14              0x40
#define _STPT14                 0x40

//==============================================================================

extern __at(0x081C) __sfr AT1ERR;

//==============================================================================
//        AT1ERRL Bits

extern __at(0x081C) __sfr AT1ERRL;

typedef union
  {
  struct
    {
    unsigned AT1ERR0            : 1;
    unsigned AT1ERR1            : 1;
    unsigned AT1ERR2            : 1;
    unsigned AT1ERR3            : 1;
    unsigned AT1ERR4            : 1;
    unsigned AT1ERR5            : 1;
    unsigned AT1ERR6            : 1;
    unsigned AT1ERR7            : 1;
    };

  struct
    {
    unsigned ERR0               : 1;
    unsigned ERR1               : 1;
    unsigned ERR2               : 1;
    unsigned ERR3               : 1;
    unsigned ERR4               : 1;
    unsigned ERR5               : 1;
    unsigned ERR6               : 1;
    unsigned ERR7               : 1;
    };

  struct
    {
    unsigned ERRL0              : 1;
    unsigned ERRL1              : 1;
    unsigned ERRL2              : 1;
    unsigned ERRL3              : 1;
    unsigned ERRL4              : 1;
    unsigned ERRL5              : 1;
    unsigned ERRL6              : 1;
    unsigned ERRL7              : 1;
    };
  } __AT1ERRLbits_t;

extern __at(0x081C) volatile __AT1ERRLbits_t AT1ERRLbits;

#define _AT1ERR0                0x01
#define _ERR0                   0x01
#define _ERRL0                  0x01
#define _AT1ERR1                0x02
#define _ERR1                   0x02
#define _ERRL1                  0x02
#define _AT1ERR2                0x04
#define _ERR2                   0x04
#define _ERRL2                  0x04
#define _AT1ERR3                0x08
#define _ERR3                   0x08
#define _ERRL3                  0x08
#define _AT1ERR4                0x10
#define _ERR4                   0x10
#define _ERRL4                  0x10
#define _AT1ERR5                0x20
#define _ERR5                   0x20
#define _ERRL5                  0x20
#define _AT1ERR6                0x40
#define _ERR6                   0x40
#define _ERRL6                  0x40
#define _AT1ERR7                0x80
#define _ERR7                   0x80
#define _ERRL7                  0x80

//==============================================================================


//==============================================================================
//        AT1ERRH Bits

extern __at(0x081D) __sfr AT1ERRH;

typedef union
  {
  struct
    {
    unsigned AT1ERR8            : 1;
    unsigned AT1ERR9            : 1;
    unsigned AT1ERR10           : 1;
    unsigned AT1ERR11           : 1;
    unsigned AT1ERR12           : 1;
    unsigned AT1ERR13           : 1;
    unsigned AT1ERR14           : 1;
    unsigned AT1ERR15           : 1;
    };

  struct
    {
    unsigned ERR8               : 1;
    unsigned ERR9               : 1;
    unsigned ERR10              : 1;
    unsigned ERR11              : 1;
    unsigned ERR12              : 1;
    unsigned ERR13              : 1;
    unsigned ERR14              : 1;
    unsigned ERR15              : 1;
    };

  struct
    {
    unsigned ERRH0              : 1;
    unsigned ERRH1              : 1;
    unsigned ERRH2              : 1;
    unsigned ERRH3              : 1;
    unsigned ERRH4              : 1;
    unsigned ERRH5              : 1;
    unsigned ERRH6              : 1;
    unsigned ERRH7              : 1;
    };
  } __AT1ERRHbits_t;

extern __at(0x081D) volatile __AT1ERRHbits_t AT1ERRHbits;

