OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1615.h
#define _AT1ERR8                0x01
#define _ERR8                   0x01
#define _ERRH0                  0x01
#define _AT1ERR9                0x02
#define _ERR9                   0x02
#define _ERRH1                  0x02
#define _AT1ERR10               0x04
#define _ERR10                  0x04
#define _ERRH2                  0x04
#define _AT1ERR11               0x08
#define _ERR11                  0x08
#define _ERRH3                  0x08
#define _AT1ERR12               0x10
#define _ERR12                  0x10
#define _ERRH4                  0x10
#define _AT1ERR13               0x20
#define _ERR13                  0x20
#define _ERRH5                  0x20
#define _AT1ERR14               0x40
#define _ERR14                  0x40
#define _ERRH6                  0x40
#define _AT1ERR15               0x80
#define _ERR15                  0x80
#define _ERRH7                  0x80

//==============================================================================


//==============================================================================
//        AT1CLK Bits

extern __at(0x088C) __sfr AT1CLK;

typedef union
  {
  struct
    {
    unsigned CS                 : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned AT1CS              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CS0                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned AT1CS0             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __AT1CLKbits_t;

extern __at(0x088C) volatile __AT1CLKbits_t AT1CLKbits;

#define _CS                     0x01
#define _AT1CS                  0x01
#define _CS0                    0x01
#define _AT1CS0                 0x01

//==============================================================================


//==============================================================================
//        AT1SIG Bits

extern __at(0x088D) __sfr AT1SIG;

typedef union
  {
  struct
    {
    unsigned AT1SSEL0           : 1;
    unsigned AT1SSEL1           : 1;
    unsigned AT1SSEL2           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SSEL0              : 1;
    unsigned SSEL1              : 1;
    unsigned SSEL2              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SSEL               : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned AT1SSEL            : 3;
    unsigned                    : 5;
    };
  } __AT1SIGbits_t;

extern __at(0x088D) volatile __AT1SIGbits_t AT1SIGbits;

#define _AT1SSEL0               0x01
#define _SSEL0                  0x01
#define _AT1SSEL1               0x02
#define _SSEL1                  0x02
#define _AT1SSEL2               0x04
#define _SSEL2                  0x04

//==============================================================================


//==============================================================================
//        AT1CSEL1 Bits

extern __at(0x088E) __sfr AT1CSEL1;

typedef union
  {
  struct
    {
    unsigned AT1CP1S0           : 1;
    unsigned AT1CP1S1           : 1;
    unsigned AT1CP1S2           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CP1S0              : 1;
    unsigned CP1S1              : 1;
    unsigned CP1S2              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned AT1CP1S            : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned CP1S               : 3;
    unsigned                    : 5;
    };
  } __AT1CSEL1bits_t;

extern __at(0x088E) volatile __AT1CSEL1bits_t AT1CSEL1bits;

#define _AT1CP1S0               0x01
#define _CP1S0                  0x01
#define _AT1CP1S1               0x02
#define _CP1S1                  0x02
#define _AT1CP1S2               0x04
#define _CP1S2                  0x04

//==============================================================================

extern __at(0x088F) __sfr AT1CC1;

//==============================================================================
//        AT1CC1L Bits

extern __at(0x088F) __sfr AT1CC1L;

typedef union
  {
  struct
    {
    unsigned AT1CC10            : 1;
    unsigned AT1CC11            : 1;
    unsigned AT1CC12            : 1;
    unsigned AT1CC13            : 1;
    unsigned AT1CC14            : 1;
    unsigned AT1CC15            : 1;
    unsigned AT1CC16            : 1;
    unsigned AT1CC17            : 1;
    };

  struct
    {
    unsigned CC10               : 1;
    unsigned CC11               : 1;
    unsigned CC12               : 1;
    unsigned CC13               : 1;
    unsigned CC14               : 1;
    unsigned CC15               : 1;
    unsigned CC16               : 1;
    unsigned CC17               : 1;
    };
  } __AT1CC1Lbits_t;

extern __at(0x088F) volatile __AT1CC1Lbits_t AT1CC1Lbits;

#define _AT1CC10                0x01
#define _CC10                   0x01
#define _AT1CC11                0x02
#define _CC11                   0x02
#define _AT1CC12                0x04
#define _CC12                   0x04
#define _AT1CC13                0x08
#define _CC13                   0x08
#define _AT1CC14                0x10
#define _CC14                   0x10
#define _AT1CC15                0x20
#define _CC15                   0x20
#define _AT1CC16                0x40
#define _CC16                   0x40
#define _AT1CC17                0x80
#define _CC17                   0x80

//==============================================================================


//==============================================================================
//        AT1CC1H Bits

extern __at(0x0890) __sfr AT1CC1H;

typedef union
  {
  struct
    {
    unsigned AT1CC18            : 1;
    unsigned AT1CC19            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CC18               : 1;
    unsigned CC19               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __AT1CC1Hbits_t;

extern __at(0x0890) volatile __AT1CC1Hbits_t AT1CC1Hbits;

